go_types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-09 Thu 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Types</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf35101f">1. Basic Types</a></li>
<li><a href="#org816b602">2. Enumerations</a>
<ul>
<li><a href="#orgc0a1bf9">2.1. iota</a></li>
</ul>
</li>
<li><a href="#org2272ba4">3. Type conversion</a></li>
<li><a href="#org68de756">4. Structs</a></li>
<li><a href="#orga2092a9">5. Initializing</a></li>
<li><a href="#orgfcb3c4d">6. Composition vs Inheritance</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf35101f" class="outline-2">
<h2 id="orgf35101f"><span class="section-number-2">1</span> Basic Types</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
bool        true or false
string

Numeric types:

uint        either 32 or 64 bits
int         same size as uint. for integer literals Go infers type int
uintptr     an unsigned integer large enough to store the uninterpreted bits of
            a pointer value
uint8       the set of all unsigned  8-bit integers (0 to 255)
uint16      the set of all unsigned 16-bit integers (0 to 65535)
uint32      the set of all unsigned 32-bit integers (0 to 4294967295)
uint64      the set of all unsigned 64-bit integers (0 to 18446744073709551615)

int8        the set of all signed  8-bit integers (-128 to 127)
int16       the set of all signed 16-bit integers (-32768 to 32767)
int32       the set of all signed 32-bit integers (-2147483648 to 2147483647)
int64       the set of all signed 64-bit integers
            (-9223372036854775808 to 9223372036854775807)

float32     the set of all IEEE-754 32-bit floating-point numbers
float64     the set of all IEEE-754 64-bit floating-point numbers.
            for floating-point literals Go infers float64

complex64   the set of all complex numbers with float32 real and imaginary parts
complex128  the set of all complex numbers with float64 real and imaginary parts
            for complex literals Go infers complex128

byte        alias for uint8
rune        alias for int32 (represents a Unicode code point)
</pre>
</div>
</div>

<div id="outline-container-org816b602" class="outline-2">
<h2 id="org816b602"><span class="section-number-2">2</span> Enumerations</h2>
<div class="outline-text-2" id="text-2">
<p>
We can group together several constant declarations using the <b>const</b> keyword just once.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">const</span> (
        Cyan = 0<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">0</span>
        Magenta <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">0</span>
        Yellow  <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">0</span>
)

fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(Cyan, Magenta, Yellow)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">ByteSize</span> <span style="color: #00ffff;">float64</span>

<span style="color: #00ff00; font-weight: bold;">const</span> (
        _           = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">ignore first value by assigning to blank identifie</span><span style="color: #DC8CC3; background-color: #3F3F3F; font-style: italic;">r</span>
        KB ByteSize = 1 &lt;&lt; (10 * <span style="color: #7fffd4;">iota</span>)
        MB
        GB
        TB
        PB
        EB
        ZB
        YB
)

fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(KB, TB, YB)
</pre>
</div>

<pre class="example">
0 0 0
1024 1.099511627776e+12 1.2089258196146292e+24

</pre>
</div>

<div id="outline-container-orgc0a1bf9" class="outline-3">
<h3 id="orgc0a1bf9"><span class="section-number-3">2.1</span> iota</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Within a constant declaration, the predeclared identifier <b>iota</b> represents successive untyped integer constants. It is reset to 0 whenever the reserved word <b>const</b> appears in the source and increments after each ConstSpec.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">const</span> ( <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">iota is reset to 0</span>
        c0 = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">c0 == 0</span>
        c1 = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">c1 == 1</span>
        c2 = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">c2 == 2</span>
)

<span style="color: #00ff00; font-weight: bold;">const</span> ( <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">iota is reset to 0</span>
        a = 1 &lt;&lt; <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">a == 1</span>
        b = 1 &lt;&lt; <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">b == 2</span>
        c = 3 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">c == 3 (iota is not used but still incremented)</span>
        d = 1 &lt;&lt; <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">d == 8</span>
)

<span style="color: #00ff00; font-weight: bold;">const</span> ( <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">iota is reset to 0</span>
        u = <span style="color: #7fffd4;">iota</span> * 42 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">u == 0 (untyped integer constant)</span>
        v float64 = <span style="color: #7fffd4;">iota</span> * 42 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">v == 42.0 (float64 constant)</span>
        w = <span style="color: #7fffd4;">iota</span> * 42 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">w == 84 (untyped integer constant)</span>
)

<span style="color: #00ff00; font-weight: bold;">const</span> x = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">x == 0 (iota has been reset)</span>
<span style="color: #00ff00; font-weight: bold;">const</span> y = <span style="color: #7fffd4;">iota</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">y == 0 (iota has been reset)</span>

fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"c2 = %d, d = %d, u = %d, v = %.01f, w = %.01f, x = %d y = %d"</span>, c2, d<span style="color: #DC8CC3; background-color: #3F3F3F;">, u, v, w, x, y)</span>
</pre>
</div>

<pre class="example">
c2 = 2, d = 8, u = 0, v = 42.0, w = %!f(int=84), x = 0 y = 0

</pre>
</div>
</div>
</div>

<div id="outline-container-org2272ba4" class="outline-2">
<h2 id="org2272ba4"><span class="section-number-2">3</span> Type conversion</h2>
<div class="outline-text-2" id="text-3">
<p>
The expression <b>T(v)</b> converts the value <b>v</b> to the type <b>T</b>. Go assignment between items of different type requires an explicit conversion which means that <span class="underline">you manually need to convert types if you are passing a variable to a function expecting another type</span>.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> i int32 = 42
<span style="color: #00ff00; font-weight: bold;">var</span> f32 float32 = <span style="color: #00ffff; font-weight: bold;">float32</span>(i)
f64 := <span style="color: #00ffff; font-weight: bold;">float64</span>(f32)
<span style="color: #00ff00; font-weight: bold;">var</span> u unit = <span style="color: #00ffff; font-weight: bold;">unit</span>(f)
</pre>
</div>
</div>
</div>
