go_types.org
* Structs
  A struct is a collection of fields/properties. You can define new types as structs or interfaces. You can think of a struct to be a light class that supports composition but not inheritance. You don’t need to define getters and setters on struct fields, they can be accessed automatically. However, note that only exported fields (capitalized) can be accessed from outside of a package.
#+NAME: bootcamp_struct
#+BEGIN_SRC go :results none :exports none
  type Bootcamp struct {
          // Latitude of the event
          Lat float64
          // Longitude of the event
          Lon float64
          // Date of the event
          Date time.Time
  }
#+END_SRC
#+BEGIN_SRC go :results output :exports both :noweb yes
  package main

  import (
          "fmt"
          "time"
  )

  <<bootcamp_struct>>

  func main() {
          fmt.Println(Bootcamp{
                  Lat:  34.012836,
                  Lon:  -118.495338,
                  Date: time.Now(),
          })
  }
#+END_SRC

#+RESULTS:
: {34.012836 -118.495338 2017-10-26 16:35:49.696554859 +1000 +10}
  A struct literal sets a newly allocated struct value by listing the values of its fields. You can list just a subset of fields by using the "Name:" syntax (the order of named fields is irrelevant when using this syntax). The special prefix & constructs a pointer to a newly allocated struct.
  #+BEGIN_SRC go :results output :exports both :noweb yes
    package main

    import (
            "fmt"
            "time"
    )

    type Point struct {
            X, Y int
    }

    <<bootcamp_struct>>

    var (
            p = Point{1, 2}  // has type Point
            q = &Point{1, 2} // has type *Point
            r = Point{X: 1}  // Y:0 is implicit
            s = Point{}      // X:0 and Y:0
    )

    func main() {
            fmt.Println(p, q, r, s)

            // accessing fields using the dot notation
            event := Bootcamp{
                    Lat: 34.012836,
                    Lon: -118.495338,
            }
            event.Date = time.Now()
            fmt.Printf("Event on %s, location (%f, %f)",
                    event.Date, event.Lat, event.Lon)
    }
  #+END_SRC

  #+RESULTS:
  : {1 2} &{1 2} {1 0} {0 0}
  : Event on 2017-10-26 16:36:10.977167189 +1000 +10, location (34.012836, -118.495338)

* Initializing
  Go supports the *new* expression to *allocate a zeroed value* of the requested type and to *return a pointer* to it.
#+BEGIN_SRC go :results none :exports code
  x := new(int)
#+END_SRC
  Following expressions using new and an empty struct literal are equivalent and result in the same kind of allocation/initialization.
#+BEGIN_SRC go :results output :exports both
  package main

  import (
          "fmt"
  )

  type Bootcamp struct {
          Lat float64
          Lon float64
  }

  func main() {
          x := new(Bootcamp)
          y := &Bootcamp{}
          fmt.Println(*x == *y)
  }
#+END_SRC

#+RESULTS:
: true

