go_types.html

<div id="outline-container-org68de756" class="outline-2">
<h2 id="org68de756"><span class="section-number-2">4</span> Structs</h2>
<div class="outline-text-2" id="text-4">
<p>
A struct is a collection of fields/properties. You can define new types as structs or interfaces. You can think of a struct to be a light class that supports composition but not inheritance. You don’t need to define getters and setters on struct fields, they can be accessed automatically. However, note that only exported fields (capitalized) can be accessed from outside of a package.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"time"</span>
)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Bootcamp</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Latitude of the event</span>
        Lat float64
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Longitude of the event</span>
        Lon float64
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Date of the event</span>
        Date time.Time
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #00ffff;">Bootcamp</span>{
                <span style="color: #7fffd4;">Lat</span>:  34.012836,
                <span style="color: #7fffd4;">Lon</span>:  -118.495338,
                <span style="color: #7fffd4;">Date</span>: time.<span style="color: #00ffff; font-weight: bold;">Now</span>(),
        })
}
</pre>
</div>

<pre class="example">
{34.012836 -118.495338 2017-11-09 19:39:36.544069188 +1000 +10}

</pre>
<p>
A struct literal sets a newly allocated struct value by listing the values of its fields. You can list just a subset of fields by using the "Name:" syntax (the order of named fields is irrelevant when using this syntax). The special prefix &amp; constructs a pointer to a newly allocated struct.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"time"</span>
)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Point</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        X, Y int
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Bootcamp</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Latitude of the event</span>
        Lat float64
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Longitude of the event</span>
        Lon float64
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Date of the event</span>
        Date time.Time
}

<span style="color: #00ff00; font-weight: bold;">var</span> (
        p = <span style="color: #00ffff;">Point</span>{1, 2}  <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">has type Point</span>
        q = &amp;<span style="color: #00ffff;">Point</span>{1, 2} <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">has type *Point</span>
        r = <span style="color: #00ffff;">Point</span>{X: 1}  <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Y:0 is implicit</span>
        s = <span style="color: #00ffff;">Point</span>{}      <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">X:0 and Y:0</span>
)

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(p, q, r, s)

        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">accessing fields using the dot notation</span>
        event := <span style="color: #00ffff;">Bootcamp</span>{
                <span style="color: #7fffd4;">Lat</span>: 34.012836,
                <span style="color: #7fffd4;">Lon</span>: -118.495338,
        }
        event.Date = time.<span style="color: #00ffff; font-weight: bold;">Now</span>()
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"Event on %s, location (%f, %f)"</span>,
                event.Date, event.Lat, event.Lon)
}
</pre>
</div>

<pre class="example">
{1 2} &amp;{1 2} {1 0} {0 0}
Event on 2017-11-09 19:39:36.874991702 +1000 +10, location (34.012836, -118.495338)

</pre>
</div>
</div>

<div id="outline-container-orga2092a9" class="outline-2">
<h2 id="orga2092a9"><span class="section-number-2">5</span> Initializing</h2>
<div class="outline-text-2" id="text-5">
<p>
Go supports the <b>new</b> expression to <b>allocate a zeroed value</b> of the requested type and to <b>return a pointer</b> to it.
</p>
<div class="org-src-container">
<pre class="src src-go">x := <span style="color: #b0c4de; font-weight: bold;">new</span>(<span style="color: #00ffff;">int</span>)
</pre>
</div>
<p>
Following expressions using new and an empty struct literal are equivalent and result in the same kind of allocation/initialization.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Bootcamp</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Lat float64
        Lon float64
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        x := <span style="color: #b0c4de; font-weight: bold;">new</span>(<span style="color: #00ffff;">Bootcamp</span>)
        y := &amp;<span style="color: #00ffff;">Bootcamp</span>{}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(*x == *y)
}
</pre>
</div>

<pre class="example">
true

</pre>
</div>
</div>
