go_types.org
* Composition vs Inheritance
  #+BEGIN_SRC go :results output :exports both
    package main

    import "fmt"

    type User struct {
            Id       int
            Name     string
            Location string
    }

    type Player struct {
            Id       int
            Name     string
            Location string
            GameId	 int
    }

    func main() {
            p := Player{}
            p.Id = 42
            p.Name = "Matt"
            p.Location = "LA"
            p.GameId = 90404
            fmt.Printf("%+v", p)
    }
  #+END_SRC
  Player struct has the same fields as the User struct but it also has a GameId field. It can be simplified by composing our struct.
  #+NAME: player_struct
  #+BEGIN_SRC go :results none :exports code
    type User struct {
            Id             int
            Name, Location string
    }

    type Player struct {
            User
            GameId int
    }
  #+END_SRC
  We can initialize a new variable of type Player two different ways.
  #+BEGIN_SRC go :results output :exports both :noweb yes
    package main

    import "fmt"

    <<player_struct>>

    func main() {
            // 1. Using the dot notation to set the fields
            p1 := Player{}
            p1.Id = 42
            p1.Name = "Matt"
            p1.Location = "LA"
            p1.GameId = 90404
            fmt.Printf("%+v", p1)
            // 2. Use struct literal
            p2 := Player{
                    User{Id: 42, Name: "Matt", Location: "LA"},
                    90404,
            }
            fmt.Printf(
                    "Id: %d, Name: %s, Location: %s, Game id: %d\n",
                    p2.Id, p2.Name, p2.Location, p2.GameId)
            // Directly set a field defined on the Player struct
            p2.Id = 11
            fmt.Printf("%+v", p2)
    }
  #+END_SRC

  #+RESULTS:
  : {User:{Id:42 Name:Matt Location:LA} GameId:90404}Id: 42, Name: Matt, Location: LA, Game id: 90404
  : {User:{Id:11 Name:Matt Location:LA} GameId:90404}
  Because our struct is composed of another struct, the methods on the User struct is also available to the Player.
  #+BEGIN_SRC go :results output :exports both :noweb yes
    package main

    import "fmt"

    <<player_struct>>

    func (u *User) Greetings() string {
            return fmt.Sprintf("Hi %s from %s",
                    u.Name, u.Location)
    }

    func main() {
            p := Player{}
            p.Id = 42
            p.Name = "Matt"
            p.Location = "LA"
            fmt.Println(p.Greetings())
    }
  #+END_SRC

  #+RESULTS:
  : Hi Matt from LA
