go_types.html

<div id="outline-container-orgfcb3c4d" class="outline-2">
<h2 id="orgfcb3c4d"><span class="section-number-2">6</span> Composition vs Inheritance</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">User</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Id       int
        Name     string
        Location string
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Player</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Id       int
        Name     string
        Location string
        GameId<span style="background-color: #BC8383;">  </span> int
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        p := <span style="color: #00ffff;">Player</span>{}
        p.Id = 42
        p.Name = <span style="color: #ffa500;">"Matt"</span>
        p.Location = <span style="color: #ffa500;">"LA"</span>
        p.GameId = 90404
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%+v"</span>, p)
}
</pre>
</div>

<pre class="example">
{Id:42 Name:Matt Location:LA GameId:90404}

</pre>

<p>
Player struct has the same fields as the User struct but it also has a GameId field. It can be simplified by composing our struct.
</p>
<div class="org-src-container">
<pre class="src src-go" id="org870caab"><span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">User</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Id             int
        Name, Location string
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Player</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        User
        GameId int
}
</pre>
</div>
<p>
We can initialize a new variable of type Player two different ways.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">User</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Id             int
        Name, Location string
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Player</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        User
        GameId int
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">1. Using the dot notation to set the fields</span>
        p1 := <span style="color: #00ffff;">Player</span>{}
        p1.Id = 42
        p1.Name = <span style="color: #ffa500;">"Matt"</span>
        p1.Location = <span style="color: #ffa500;">"LA"</span>
        p1.GameId = 90404
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%+v"</span>, p1)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">2. Use struct literal</span>
        p2 := <span style="color: #00ffff;">Player</span>{
                <span style="color: #00ffff;">User</span>{Id: 42, Name: <span style="color: #ffa500;">"Matt"</span>, Location: <span style="color: #ffa500;">"LA"</span>},
                90404,
        }
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(
                <span style="color: #ffa500;">"Id: %d, Name: %s, Location: %s, Game id: %d\n"</span>,
                p2.Id, p2.Name, p2.Location, p2.GameId)
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Directly set a field defined on the Player struct</span>
        p2.Id = 11
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%+v"</span>, p2)
}
</pre>
</div>

<pre class="example">
{User:{Id:42 Name:Matt Location:LA} GameId:90404}Id: 42, Name: Matt, Location: LA, Game id: 90404
{User:{Id:11 Name:Matt Location:LA} GameId:90404}

</pre>
<p>
Because our struct is composed of another struct, the methods on the User struct is also available to the Player.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">User</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Id             int
        Name, Location string
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Player</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        User
        GameId int
}

<span style="color: #00ff00; font-weight: bold;">func</span> (u *<span style="color: #00ffff;">User</span>) <span style="color: #00ffff; font-weight: bold;">Greetings</span>() <span style="color: #00ffff;">string</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> fmt.<span style="color: #00ffff; font-weight: bold;">Sprintf</span>(<span style="color: #ffa500;">"Hi %s from %s"</span>,
                u.Name, u.Location)
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        p := <span style="color: #00ffff;">Player</span>{}
        p.Id = 42
        p.Name = <span style="color: #ffa500;">"Matt"</span>
        p.Location = <span style="color: #ffa500;">"LA"</span>
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(p.<span style="color: #00ffff; font-weight: bold;">Greetings</span>())
}
</pre>
</div>

<pre class="example">
Hi Matt from LA

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-11-09 Thu 19:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
